fractions="""Програма навчання дробів:

Урок 1: Введення в дроби

Поняття дробів та їх основні характеристики.
Представлення дробів у вигляді кола та смуги.
Порівняння дробів за допомогою знаків "<" та ">".


Урок 2: Складання дробів з однаковими знаменниками

Знайомство з поняттям спільного знаменника та його застосування при складанні дробів.
Практика складання дробів з однаковими знаменниками за допомогою вправ.


Урок 3: Складання дробів з різними знаменниками

Знайомство з методами приведення знаменників до спільного.
Вправи на складання дробів з різними знаменниками.


Урок 4: Віднімання дробів

Пояснення процесу віднімання дробів та його зв'язку зі складанням.
Практика віднімання дробів з різними та однаковими знаменниками.


Урок 5: Множення дробів

Пояснення поняття множення дробів та його зв'язок з повторенням частин.
Практика множення дробів з цілими числами та між собою.


Урок 6: Ділення дробів

Пояснення процесу ділення дробів та його зв'язок з множенням на обернену величину.
Практика ділення дробів на цілі числа та одне на одне.


Урок 7: Практичне застосування дробів

Розв'язування простих задач, пов'язаних з частинами, долями числа та змішаними числами.
Застосування дробів у реальних життєвих ситуаціях.


Урок 8: Повторення та підбиття підсумків

Повторення всіх основних понять та навичок, пов'язаних з дробами.
Розв'язування різноманітних задач для закріплення матеріалу."""